//**********************************************************************************************************************
void outputComWorld(char name, int num) //Вывод  "машинное  слово"
{
    std::cout
            << "\n=========================================================================================================\n";
    std::cout << "В виде машинного слова множесто " << name << ":";
    for (int i = U - 2; i >= 0; --i)
        std::cout << ((num >> i) & 1);
    std::cout << "\nМножество " << name << ": ";
    for (int i = 0; i <= U; i++)
        if ((num >> i) & 1)
            std::cout << Universum[i];
    std::cout
            << "\n=========================================================================================================\n";

}
//**********************************************************************************************************************
void outputSet(Set *p)// Вывод односвязного списка
{
    if (p == nullptr) {
        std::cout << std::endl;
        return;
    }
    do {
        std::cout << p->el;
        p = p->next;
    } while (p != nullptr);
}
//**********************************************************************************************************************
void outputArrBit(int (&bit)[U], char name)//Вывод массива битов
{
    std::cout
            << "\n=========================================================================================================\n";
    std::cout << "В виде масива битов множество " << name << ": ";
    for (int i = 0; i < U - 1; ++i)
        if (bit[i])
            std::cout << bit[i];
        else std::cout << "_";
    std::cout << "\nМножесто " << name << ": ";
    for (int i = 0; i < U; ++i) {
        if (bit[i] == 1) {
            std::cout << Universum[i];
        }
    }
    std::cout
            << "\n=========================================================================================================\n";
}
//**********************************************************************************************************************
void menu1()//меню выбора способа ввода данных
{

    std::cout
            << "\n=========================================================================================================\n";
    std::cout << "Каким способом ввести данные?\n";
    std::cout << "1)Вручную\n";
    std::cout << "2)Рандом\n";
    std::cout << "0)Выход";
    std::cout
            << "\n=========================================================================================================\n";
}
//**********************************************************************************************************************
void menu2()//меню выбора способа выполнения программы
{

    std::cout
            << "\n=========================================================================================================\n";
    std::cout << "Каким спопосбом выполнить обработку множетсва?" << std::endl;
    std::cout << "1)Массив" << std::endl;
    std::cout << "2)Список" << std::endl;
    std::cout << "3)Массив битов" << std::endl;
    std::cout << "4)Машинное слово" << std::endl;
    std::cout << "5)Назад в меню ввода" << std::endl;
    std::cout
            << "=========================================================================================================\n";
}
//**********************************************************************************************************************
void outputTime(int t1, int t2)//Вывод времени работы программы
{
   long long int  T;
    T = (((t2 - t1)*1000 )/ CLOCKS_PER_SEC);
    std::cout << "\nВремя выполнения " << T<< " миллиcекунд, выполнено " << numExe << " раз\n";

}
//**********************************************************************************************************************
void outputCommonArr(char *A, char *B, char *C, char *D, char *E)//Вывод результатов метода "Массива char"
{
    std::cout
            << "\n=========================================================================================================\n";
    std::cout << "Множество А: " << A << std::endl;
    std::cout << "Множество B: " << B << std::endl;
    std::cout << "Множество C: " << C << std::endl;
    std::cout << "Множество D: " << D << std::endl;
    std::cout << "Множество E: " << E;
    std::cout
            << "\n=========================================================================================================\n";
}
//**********************************************************************************************************************
void outputCommonSet(Set *A2, Set *B2, Set *C2 , Set *D2, Set *E2)//Вывод результатов метода "Односвязный список"
{
    std::cout
            << "\n=========================================================================================================\n";
    std::cout << "Множество А: ";
    outputSet(A2);
    std::cout << "\nМножество B: ";
    outputSet(B2);
    std::cout << "\nМножество C: ";
    outputSet(C2);
    std::cout << "\nМножество D: ";
    outputSet(D2);
    std::cout << "\nМножество E: ";
    outputSet(E2);
    std::cout
            << "\n=========================================================================================================\n";
}
//**********************************************************************************************************************
void outputCommonArrBit(int (&bA)[U], int (&bB)[U], int (&bC)[U], int (&bD)[U], int (&bE)[U])//Вывод результатов метода "Массива битов"
{
    outputArrBit(bA, 'A');
    outputArrBit(bB, 'B');
    outputArrBit(bC, 'C');
    outputArrBit(bD, 'D');
    outputArrBit(bE, 'E');
}
//**********************************************************************************************************************
void outputCommonComWorld(int wA,int wB,int wC,int wD,int wE)//Вывод результатов метода "Машинное слово"
{
    outputComWorld('A', wA);
    outputComWorld('B', wB);
    outputComWorld('C', wC);
    outputComWorld('D', wD);
    outputComWorld('E', wE);
}
//**********************************************************************************************************************